"""В этом задании вы можете поэкспериментировать с разными ошибками и посмотреть на сообщения о них. По очереди 
скрывайте строчки с неверным кодом «решётками» — помните, что значит «закомментировать»? Cообщения об ошибках выдает 
не наш тренажёр, а сам Python. Когда наэкспериментируетесь, удалите весь код (тренажёр не пропускает код с ошибками), 
и нажимайте кнопку «Проверить», чтобы попасть в следующий урок. Если по дороге нажмёте на подсказку — не пожалеете: 
там кое-что любопытное насчёт ошибок в Python. """

# Задание
one_hundred = 100
#print(one_hunred)
#print(3 + )
#print(3 + 5
#print('Привет!)

#Решение
one_hundred = 100
#print(one_hunred)

#print(3 + )

#print(3 + 5

#print('Привет!)
