# Задача №1
"""Напечатайте на экран город, в котором живет Серёга."""
# решение
friends = {'Серёга': 'Омск', 'Соня': 'Москва', 'Дима': 'Челябинск'}
print(friends['Серёга'])

# Задача №2
"""2.Серёга переехал в Оренбург. Получив по ключу доступ к записи о его городе, отразите этот факт в словаре."""

# Решение
friends = {'Серёга': 'Оренбург', 'Соня': 'Москва', 'Дима': 'Челябинск'}

# ваш код здесь
print('Серёга теперь живет в славном городе ' + friends['Серёга'])
